/**
 * @file app.js
 * @author swan
 */

/* globals swan */

App({
    data: {
        select_num:1,//选0为真心话，选1为大冒险
        rank:1,//不同等级
        id:0,//随机抽取的id
        zxh:[["近一个星期内最让你开心的事？","最害怕的三件事物。？","最喜欢的食物","给你一个机会穿越到过去或未来，你选哪一个？为什么？","如果让你形容自己会用哪三个词语？","认为自己和哪种动物最相近？为什么?","你的偶像是谁？","童年最有趣的一次经历是什么？","面对和他人产生的矛盾，你会怎么办?","最令你感到痛苦与心灵煎熬的人生中的一件大事？","小时候第一次挨揍或被老师狠批的具体经过？","你最喜欢的一首歌？","你最想要的5样东西？","你最喜欢的电视剧？","比较喜欢妈妈还是爸爸？","2020年最后悔的一件事是什么？","最后一次发自内心的笑是什么时候?","你最喜欢哪一部电影？","你最想去哪一个地方去旅行？","你最喜欢哪一个地方？"],["你心目中理想的爱人是什么样子？","你觉得自己长得如何？","你觉得自己的初恋和在座的哪一个人长得最像？","初吻的年龄是？","如果可以用在座的一位的性命换你不死，你会选择谁？","你的小癖好是什么？","与喜欢的人见面会穿成什么样子？","第一次表白对象是谁？","世界末日，你会选择在场的谁和你一起？","如果你爱的人不爱你怎么办？","你会怎么拒绝你不爱的人的表白？","你恨过谁？","蓝朋友和蓝闺蜜同时约你，你会选谁？","女朋友和女闺蜜同时约你，你会选谁？","爱情和友情哪一个更重要？","选择面包还是爱情","如果把你关在一个房间里，要女朋友还是游戏？","对对方撒过谎吗？","喜欢男女生做些什么小动作?","你身上有没有胎记?长在什么地方，什么形状?"],["在你眼里，我是一个怎么样的人？","如果我喜欢你你会怎么办？","怎么样看待性？","你赞同性生活应该在婚前还是婚后？","你喜欢过同性吗？","在座的你讨厌谁？","当过第三者吗？","最多同时交往过几个人","到目前为止谈过几次恋爱？","曾经或者是否接受走后门","描述一下你高潮的感觉?","你喜欢在上面还是在下面?","是否叫过小姐/牛郎?","谁是你的第一次?","最喜欢的AV明星?","你愿意为了爱情做什么牺牲?","朋友和男朋友，哪个重要?","你有没有角色扮演过?","自己身上哪个部位最敏感?","说出五种避孕方式?"]],//真心话库
        dmx:[["用手纸当围巾围脖子上，并坚持到下轮结束","双手揪耳朵说“我错了”并做蛙跳个","右手跨过后脑勺从左边摸右眼","学动物叫（指定一个动物如：骆驼，蛇等）","做一个大家都满意的鬼脸","唱两只老虎","舔下嘴唇跟正对面的玩家说“你看起来真可口”","唱青藏高原最终一句","男生做十五下俯卧撑，女生原地跳十次","大喊“我是人见人爱，花见花开的小萝莉”","选一个人对着他唱《好爸爸坏爸爸》","为右边的第一个男生脱衣服","找一名异性，单膝下跪亲吻对方那个手","表演大猩猩捶胸呐喊","站在厕所门口对出去的人说“好吃再来啊~”","给最近的人擦鞋","和距离最远的异性喝交杯酒","先大笑五秒，再大哭五秒","走到对面的包房坐下然后猛然站起，走回来","大喊：“我是猪，我是猪，我真的是猪！”"],["学小狗向左边的异性撒娇。","和右边第一位的异性拥抱一下。","选择一位异性十指交扣，深情对视，唱月亮代表我的心。","发朋友圈：和我处对象，给你一个海边别墅，一辆路虎揽胜，一张7位数的银行卡够不够？不够我再喝点。","抱着正对面的人的大腿唱情歌","选一个男生，锤他胸口，并说“你好厌恶哦”","打开抖音模仿推荐的第一个人","选择一名异性向她他深情表白","对异性服务员说:请给我你的微笑我要打包","抱起右手边的人，坚持五秒","做自我最性感妩媚的动作","找一个异性，让她他把腿放你肩膀上，给对方揉腿","挑起自我的bra带子，对着别人很得意地说：“看，名牌儿”（男生内裤边）","站在厕所门口对进去的人说“欢迎光临”","摸着自我的胸说“唉，太小了”（男生）","随便找三个异性，一个一个地娇羞问：“我美吗？”三个人都说美才算经过","和左边的第一名异性换穿衣服","模仿古代青楼女子拉客","跳肚皮舞","找个陌生人，握住人家的手，很激动地说：“我没能奔小康拖你们的后腿了”"],["学超级名模走秀绕场一周","想办法让指定的一名异性兴奋起来","打着伞到一位陌生人面前盯着他说一声“我是蘑菇”","用其他人手机给男女朋友打个电话，让对方猜自我是谁","和在场的一位异性应对面说一分钟情话（不能冷场哦）","亲吻一分钟墙壁","打电话给另一半（或者异性朋友）说“我知道你跟ta的事了”然后挂断","打电话给某人，说：“你好，我在玩真心话大冒险，输了，要打电话跟你表白。对了，我选的是真心话”","应对面相隔做接吻陶醉状十秒","跳钢管舞，其中一人做人肉钢管","深情的吻墙5秒","和左数第一个异性亲一下","十指相扣，深情对视，朗诵骆宾王的《鹅》","和右边第一个异性关在厕所里等一轮游戏","说出京杭大运河的经过的中国五大水系；","亲左数第二个异性的额头","找一男生把腿架他肩膀上让他捶腿","两人应对面作搓澡状，屁股还要一扭一扭的，还要唱'洗刷刷，洗刷刷'","亲左数第二个异性的额头","对喝交杯酒","一人将另外一人壁咚在角落，深情对视十秒"]],//大冒险库
        //customize_zxh:[],//存储自拟的真心话
        //customize_dmx:[],//存储自拟的大冒险
        zxh_str:"",
        dmx_str:"",
        zxhnum:0,//自拟的真心话数量
        dmxnum:0,//自拟的大冒险数量
        zxhid:0,//随机抽取真心话的id
        dmxid:0,//随机抽取大冒险的id
        zxh_items:[{text:"",value:0},{text:"",value:1},{text:"",value:2},{text:"",value:3},{text:"",value:4},{text:"",value:5},{text:"",value:6},{text:"",value:7},{text:"",value:8},{text:"",value:9},{text:"",value:10},{text:"",value:11},{text:"",value:12},{text:"",value:13},{text:"",value:14},{text:"",value:15},{text:"",value:16},{text:"",value:17},{text:"",value:18},{text:"",value:19},{text:"",value:20},{text:"",value:21},{text:"",value:22},{text:"",value:23},{text:"",value:24},{text:"",value:25},{text:"",value:26},{text:"",value:27},{text:"",value:28},{text:"",value:29},{text:"",value:30},{text:"",value:31},{text:"",value:32},{text:"",value:33},{text:"",value:34},{text:"",value:35},{text:"",value:36},{text:"",value:37},{text:"",value:38},{text:"",value:39},{text:"",value:40},{text:"",value:41},{text:"",value:42},{text:"",value:43},{text:"",value:44},{text:"",value:45},{text:"",value:46},{text:"",value:47},{text:"",value:48},{text:"",value:49}
        ],//存储自拟的真心话
        dmx_items:[{text:"",value:0},{text:"",value:1},{text:"",value:2},{text:"",value:3},{text:"",value:4},{text:"",value:5},{text:"",value:6},{text:"",value:7},{text:"",value:8},{text:"",value:9},{text:"",value:10},{text:"",value:11},{text:"",value:12},{text:"",value:13},{text:"",value:14},{text:"",value:15},{text:"",value:16},{text:"",value:17},{text:"",value:18},{text:"",value:19},{text:"",value:20},{text:"",value:21},{text:"",value:22},{text:"",value:23},{text:"",value:24},{text:"",value:25},{text:"",value:26},{text:"",value:27},{text:"",value:28},{text:"",value:29},{text:"",value:30},{text:"",value:31},{text:"",value:32},{text:"",value:33},{text:"",value:34},{text:"",value:35},{text:"",value:36},{text:"",value:37},{text:"",value:38},{text:"",value:39},{text:"",value:40},{text:"",value:41},{text:"",value:42},{text:"",value:43},{text:"",value:44},{text:"",value:45},{text:"",value:46},{text:"",value:47},{text:"",value:48},{text:"",value:49}
        ],//存储自拟的大冒险
        value_zxh:[],
        value_dmx:[],
        ul:"",//存储不同的图像
        url:"../../images/background.jpg"

    },
    onshow(){
        swan.setPageInfo({
            title: 'app.js',
            keywords: '',
            description: '',
            releaseDate: '',
            image: '',
            video: ''
        });
    },
    onLaunch(options) {
        // do something when launch
    },
    onShow(options) {
        // do something when show
    },
    onHide() {
        // do something when hide
    }
});
